[
  {
    "id": 1,
    "company": "NEORIS",
    "positions": [
      {
        "position": "Software Developer Analyst",
        "description": [
            "BRICKELL (BBVA) - Desarrollo de la feature completa de 'TRANSFERENCIAS INTERNAS', planteamiento de objetivos y desarrollo de funcionalidades en arquitectura CELLS (Componentes UI, DM), compilacion, testing y resolucion de bugs. (Sept – Actualidad)",
            "HORIZON (BBVA) - Desarrollo de features y diferentes funcionalidades en arquitectura CELLS para la actualización y transición de servicios locales a globales, algunas como Customer Logins, Economic Data y Product Detail. - (Enero– Septiembre)",
            "HORIZON (BBVA) - Desarrollo de features y diferentes funcionalidades para la actualización y transición de servicios locales a globales en su primera etapa, elaboración de un componente caudalímetro para el flujo de usuarios- (2023, Mayo- Diciembre)",
            "CHANNELS (BBVA) - Análisis y resolución de incidencias de la aplicación GLOMO, desarrollando diferentes soluciones a bugs con distintas prioridades- (2023, Abril - Mayo)"
          ],
          "startDate": "2023",
          "endDate": "Actualidad",
          "skills": [
            "CELLS",
            "HTML",
            "CSS",
            "JavaScript",
            "Test e2e",
            "Jenkins",
            "SonarQube",
            "Polymer.js",
            "Lit-Element"
          ]
          }
        ],
        "logoUrl": "https://s3.us-west-2.amazonaws.com/andresbojaca.site/neoris_logo.jpg"
        },
        {
        "id": 2,
        "company": "AECSA",
        "positions": [
          {
          "position": "Desarrollador Senior",
          "description": "Resolución de errores críticos, asegurando la estabilidad y el correcto funcionamiento del sistema. Optimización de módulos existentes, mejorando el rendimiento y la eficiencia del código. Contrubución a proyectos y funcionalidades de manejo interno.",
          "startDate": "Ago",
          "endDate": "Sep 2023",
          "skills": [
            "PHP",
            "MySQL",
            "JavaScript",
            "jQuery",
            "CSS",
            "Bootstrap"
          ]
          }
        ],
        "logoUrl": "https://s3.us-west-2.amazonaws.com/andresbojaca.site/aecsa_logo.jpg"
        },
        {
        "id": 3,
        "company": "GoDoWorks",
        "positions": [
          {
          "position": "FrontEnd Manager Senior",
          "description": "Desarrollé componentes y gestioné el diseño y la experiencia visual de herramientas web, asegurando un look and feel consistente y atractivo. Personalicé soluciones para clientes, implementé marcas blancas en la plataforma y elaboré propuestas innovadoras de diseño y desarrollo. Trabajé con tecnologías de vanguardia.",
          "startDate": "2021",
          "endDate": "2022",
          "skills": [
            "PHP",
            "HTML",
            "JavaScript",
            "CSS",
            "Bootstrap",
            "Twig",
            "MySQL",
            "jQuery"
          ]
          },
          {
          "position": "Desarrollador Web",
          "description": "Inclusión de nuevas funcionalidades, ampliando las capacidades del sitio web. Resolución de bugs, mejorando la estabilidad y el rendimiento del sistema. Refactorización de código, optimizando la estructura y la legibilidad del código existente.",
          "startDate": "2019",
          "endDate": "2021",
          "skills": [
            "PHP",
            "HTML",
            "CSS",
            "JavaScript",
            "Bootstrap",
            "MySQL",
            "jQuery"
          ]
          }
        ],
        "logoUrl": "https://s3.us-west-2.amazonaws.com/andresbojaca.site/godoworks_logo.jpg"
        },
        {
        "id": 4,
        "company": "App3ar Companny",
        "positions": [
          {
          "position": "CEO y Desarrollador Senior",
          "description": "Fundé y gestioné mi propia empresa, donde me encargué de atender y fidelizar clientes mediante soluciones personalizadas adaptadas a sus necesidades. Administré recursos de forma eficiente, lideré un equipo de trabajo y desarrollé proyectos personalizados. Mi enfoque estuvo siempre en garantizar la calidad del servicio y cumplir con los objetivos establecidos, promoviendo una experiencia positiva para los clientes.",
          "startDate": "2020",
          "endDate": "2022",
          "skills": [
            "WordPress",
            "React Native",
            "React.js",
            "CSS",
            "JavaScript",
            "Tailwind",
            "MySQL",
            "NodeJS"
          ]
          }
        ],
        "logoUrl": "https://s3.us-west-2.amazonaws.com/andresbojaca.site/app3arcom_logo.jpg"
        },
        {
        "id": 5,
        "company": "Grupo Append",
        "positions": [
          {
          "position": "Desarrollador FulStack",
          "description": "Trabajé como desarrollador Full Stack, participando en el desarrollo de aplicaciones y productos tanto propios como para clientes. Fuí responsable de la gestión y desarrollo de dos productos internos, además de crear páginas web personalizadas. También lideré procesos de selección de personal y asumí un rol de liderazgo, coordinando equipos para garantizar la calidad y el cumplimiento de los objetivos establecidos.",
          "startDate": "Feb",
          "endDate": "Mar 2019",
          "skills": [
            "HTML",
            "CSS",
            "JavaScript",
            "PHP",
            "Laravel",
            "MySQL"
          ]
          },
          {
          "position": "Desarrollador FrontEnd",
            "description": "Construía y optimizaba las landing pages de productos propios, asegurando una experiencia de usuario fluida y atractiva. Maqueteaba diseños de interfaces siguiendo las mejores prácticas de UX/UI, mejorando la accesibilidad y el rendimiento del sitio. Implementaba soluciones responsivas para garantizar la compatibilidad con diferentes dispositivos y navegadores, y colaboraba estrechamente con el equipo de diseño para alinear los objetivos del proyecto.",
          "startDate": "Ene",
          "endDate": "Feb 2019",
          "skills": [
            "PHP",
            "HTML",
            "JavaScript",
            "CSS",
            "Bootstrap",
            "MySQL",
            "jQuery"
          ]
          }
        ],
        "logoUrl": "https://s3.us-west-2.amazonaws.com/andresbojaca.site/1630521081825.jpg"
        },
        {
        "id": 6,
        "company": "GoDoWorks",
        "positions": [
          {
          "position": "Desarrollador FrontEnd",
          "description": "Trabajé como desarrollador junior, colaborando en proyectos web y siguiendo instrucciones para implementar el diseño del front-end, además de aportar pequeñas propuestas de mejora. Participé en tareas de desarrollo contribuyendo al diseño y funcionalidad de diversas herramientas.",
          "startDate": "Ene",
          "endDate": "Feb 2019",
          "skills": [
            "PHP",
            "HTML",
            "JavaScript",
            "CSS",
            "Bootstrap",
            "MySQL",
            "jQuery"
          ]
          }
        ],
        "logoUrl": "https://s3.us-west-2.amazonaws.com/andresbojaca.site/godoworks_logo.jpg"
        }
      ]
